In [ ]:
'''Assignment No. 3
Title of the Assignment: Data Visualization I
Descriptive Statistics - Measures of Central Tendency and variability
Perform the following operations on any open source dataset (e.g., data.csv)
1. Provide summary statistics (mean, median, minimum, maximum, standard deviation) for a dataset (age, 
income etc.) with numeric variables grouped by one of the qualitative (categorical) variable. For 
example, if your categorical variable is age groups and quantitative variable is income, then provide 
summary statistics of income grouped by the age groups. Create a list that contains a numeric value for 
each response to the categoricalvariable.
2. Write a Python program to display some basic statistical details like percentile, mean, standard 
deviation etc. of the species of ‘Iris-setosa’, ‘Iris-versicolor’ and ‘Iris-verginica’ ofiris.csv dataset. 
Provide the codes with outputs and explain everything that you do in this step'''

In [ ]:
#part 1

In [14]:
import pandas as pd

df=pd.read_csv("p3.csv")

In [17]:
df.Age_Group.unique()
print(df)

  Age_Group  Income
0     16-20     234
1     20-22     343
2     22-24     454
3     24-26     564
4     26-28     642
5     28-30     435

In [19]:
print(df.groupby(df.Age_Group).count())
print(df.groupby(df.Age_Group).min())
print(df.groupby(df.Age_Group).max())
print(df.groupby(df.Age_Group).mean())
print(df.groupby(df.Age_Group).median())
print(df.groupby(df.Age_Group).std())

           Income
Age_Group
16-20           1
20-22           1
22-24           1
24-26           1
26-28           1
28-30           1
           Income
Age_Group
16-20         234
20-22         343
22-24         454
24-26         564
26-28         642
28-30         435
           Income
Age_Group
16-20         234
20-22         343
22-24         454
24-26         564
26-28         642
28-30         435
           Income
Age_Group
16-20       234.0
20-22       343.0
22-24       454.0
24-26       564.0
26-28       642.0
28-30       435.0
           Income
Age_Group
16-20       234.0
20-22       343.0
22-24       454.0
24-26       564.0
26-28       642.0
28-30       435.0
           Income
Age_Group
16-20         NaN
20-22         NaN
22-24         NaN
24-26         NaN
26-28         NaN
28-30         NaN

In [20]:
df.groupby(df.Age_Group).describe()

          Income
           count   mean std    min    25%    50%    75%    max
Age_Group
16-20        1.0  234.0 NaN  234.0  234.0  234.0  234.0  234.0
20-22        1.0  343.0 NaN  343.0  343.0  343.0  343.0  343.0
22-24        1.0  454.0 NaN  454.0  454.0  454.0  454.0  454.0
24-26        1.0  564.0 NaN  564.0  564.0  564.0  564.0  564.0
26-28        1.0  642.0 NaN  642.0  642.0  642.0  642.0  642.0
28-30        1.0  435.0 NaN  435.0  435.0  435.0  435.0  435.0

In [4]:
#part 2

In [21]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

In [22]:
# reading database in variables
df = pd.read_csv("iris.csv")
print(df.head())

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [23]:
df.species.unique()

array(['setosa', 'versicolor', 'virginica'], dtype=object)

In [24]:
grouped_df = df.groupby('species').mean()
grouped_df

            sepal_length  sepal_width  petal_length  petal_width
species
setosa             5.006        3.418         1.464        0.244
versicolor         5.936        2.770         4.260        1.326
virginica          6.588        2.974         5.552        2.026

In [25]:
df.groupby(df.species).count()#like we can find min() , max(), std()

            sepal_length  sepal_width  petal_length  petal_width
species
setosa                50           50            50           50
versicolor            50           50            50           50
virginica             50           50            50           50

In [29]:
df.groupby(df.species).min()
df.groupby(df.species).max()
df.groupby(df.species).mean()
df.groupby(df.species).std()
df.groupby(df.species).median()

            sepal_length  sepal_width  petal_length  petal_width
species
setosa               5.0          3.4          1.50          0.2
versicolor           5.9          2.8          4.35          1.3
virginica            6.5          3.0          5.55          2.0